# FbxLightPhotometricsFam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FbxLightPhotometricsFam Property
ParameterTypeId Class See Also
---
"Light Source Definition (family)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FbxLightPhotometricsFam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FbxLightPhotometricsFam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FbxLightPhotometricsFam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace